Autodesk.Revit.DB.Structure.AreaLoad.SetLoops(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Sets curve loops that define geometry of the area load.
Remarks:
This method works with non hosted area load only.
All previously defined reference points will be removed.
doc:
The document that contains the area load.
newLoops:
Loops that define new geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when newLoops collection is empty.
-or-
Thrown when newLoops contains open loop.
-or-
Thrown when newLoops contains a loop consisting of other elements then lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.IsValidHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the provided host id can host area loads
The document containing both the host and the load
The id of the analytical panel that is about to host an area load
True if an area load can be placed on the input host id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.Int32},Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new non-hosted area load within the project.
aDoc:
Document to which new area load will be added.
loops:
The loops that define geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
forceVectors:
The array of force vectors applied to the maximum three reference point of the area load.
refPointCurveIndexes:
The array of maximum three curve indexes on which reference points should be placed on.
refPointCurveSelectors:
The array of maximum three curve selectors (start or end points) indicating where reference points should be placed on.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new non-hosted area load within the project.
aDoc:
Document to which new area load will be added.
loops:
The loops that define geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
forceVector:
The force vector applied to the 1st reference point of the area load.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new hosted area load within the project.
aDoc:
Document to which new area load will be added.
hostElemId:
The analytical surface host element id for the area Load.
forceVector:
The force vector applied to the 1st reference point of the area load.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElemId does not exist in the document
-or-
hostElemId is not permitted for this type of load.
-or-
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2023